app/views/vinyls/_vinyl_header.html.erb

SELECT COUNT(*) FROM "vinyls"
---
<h3>Vinyl Collection</h3>
<h5 id="VinylCount"><%= Vinyl.all.count %> Records and Counting!</h5>