app/views/vinyls/index.html.erb

SELECT "vinyls".* FROM "vinyls"
---

<% Vinyl.all.each do |v| %>