app/views/vinyls/index.html.erb

SELECT  "artists".* FROM "artists"  WHERE "artists"."vinyl_id" = ? LIMIT 1  [["vinyl_id", 1]]
SELECT "vinyls".* FROM "vinyls"   ORDER BY "vinyls"."artist" ASC, "vinyls"."album" ASC
---
<div id="VinylCollection">
	<% Vinyl.all.order(:artist, :album).each do |v| %>