app/controllers/vinyls_controller.rb

SELECT "vinyls".* FROM "vinyls"   ORDER BY "vinyls"."album" ASC
---
	def detail
		if session[:user_id]
			user = User.find(session[:user_id])
			@vinyls = user.vinyls.order(:album)