app/controllers/vinyls_controller.rb

SELECT "vinyls".* FROM "vinyls"
---
	def index
		@vinyls = Vinyl.all

SELECT  "vinyls".* FROM "vinyls"  WHERE "vinyls"."id" = ? LIMIT 1  [["id", 5]]
---
	def show
		@vinyl = Vinyl.find(params[:id])

INSERT INTO "vinyls" ("album", "artist", "created_at", "genre", "updated_at", "year") VALUES (?, ?, ?, ?, ?, ?)  [["album", "Faustian Echoes"], ["artist", "Agalloch"], ["created_at", "2014-08-12 03:09:32.902292"], ["genre", "Metal"], ["updated_at", "2014-08-12 03:09:32.902292"], ["year", 2013]]
---
	def create
		@vinyl = Vinyl.new(vinyl_params)
		if @vinyl.save

SELECT  "vinyls".* FROM "vinyls"  WHERE "vinyls"."id" = ? LIMIT 1  [["id", 3]]
---
	def edit
		@vinyl = Vinyl.find(params[:id])

SELECT  "vinyls".* FROM "vinyls"  WHERE "vinyls"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "vinyls" SET "album" = ?, "cover" = ?, "updated_at" = ? WHERE "vinyls"."id" = 14  [["album", "Troubador"], ["cover", "http://i75.photobucket.com/albums/i303/CLMCII/George%20Strait%20Album%20Cover%20Collection/Troubadour.jpg"], ["updated_at", "2014-09-18 01:54:29.303029"]]
---
	def update
		@vinyl = Vinyl.find(params[:id])
		@vinyl.update_attributes(vinyl_params)

SELECT  "vinyls".* FROM "vinyls"  WHERE "vinyls"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "vinyls" WHERE "vinyls"."id" = ?  [["id", 1]]
---
	def destroy
		@vinyl = Vinyl.find(params[:id])
		@vinyl.destroy

SELECT "vinyls".* FROM "vinyls"
---
	def detail
		@vinyls = Vinyl.all